; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f5-p22-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 
             p20 p21 - passenger
             f0 f1 f2 f3 f4 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)

(above f1 f2)
(above f1 f3)
(above f1 f4)

(above f2 f3)
(above f2 f4)

(above f3 f4)



(origin p0 f2)
(destin p0 f0)

(origin p1 f4)
(destin p1 f3)

(origin p2 f0)
(destin p2 f1)

(origin p3 f4)
(destin p3 f3)

(origin p4 f2)
(destin p4 f0)

(origin p5 f0)
(destin p5 f4)

(origin p6 f1)
(destin p6 f3)

(origin p7 f2)
(destin p7 f1)

(origin p8 f3)
(destin p8 f0)

(origin p9 f4)
(destin p9 f3)

(origin p10 f2)
(destin p10 f0)

(origin p11 f1)
(destin p11 f2)

(origin p12 f3)
(destin p12 f1)

(origin p13 f4)
(destin p13 f2)

(origin p14 f1)
(destin p14 f0)

(origin p15 f3)
(destin p15 f2)

(origin p16 f4)
(destin p16 f0)

(origin p17 f2)
(destin p17 f0)

(origin p18 f2)
(destin p18 f1)

(origin p19 f0)
(destin p19 f2)

(origin p20 f3)
(destin p20 f0)

(origin p21 f1)
(destin p21 f3)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
(served p17)
(served p18)
(served p19)
(served p20)
(served p21)
))
)

; plan
1. (board f0 p5)
   added: (boarded p5)
   goals met: 0 of 22
2. (board f0 p19)
   added: (boarded p19)
   goals met: 0 of 22
3. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 22
4. (board f1 p6)
   added: (boarded p6)
   goals met: 0 of 22
5. (board f1 p21)
   added: (boarded p21)
   goals met: 0 of 22
6. (board f1 p14)
   added: (boarded p14)
   goals met: 0 of 22
7. (board f1 p11)
   added: (boarded p11)
   goals met: 0 of 22
8. (up f1 f4)
   deleted: (lift-at f1)
   added: (lift-at f4)
   goals met: 0 of 22
9. (depart f4 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 1 of 22
10. (board f4 p9)
   added: (boarded p9)
   goals met: 1 of 22
11. (board f4 p3)
   added: (boarded p3)
   goals met: 1 of 22
12. (board f4 p16)
   added: (boarded p16)
   goals met: 1 of 22
13. (board f4 p13)
   added: (boarded p13)
   goals met: 1 of 22
14. (board f4 p1)
   added: (boarded p1)
   goals met: 1 of 22
15. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 1 of 22
16. (board f3 p15)
   added: (boarded p15)
   goals met: 1 of 22
17. (board f3 p12)
   added: (boarded p12)
   goals met: 1 of 22
18. (board f3 p20)
   added: (boarded p20)
   goals met: 1 of 22
19. (board f3 p8)
   added: (boarded p8)
   goals met: 1 of 22
20. (depart f3 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 2 of 22
21. (depart f3 p21)
   deleted: (boarded p21)
   added: (served p21)
   goals met: 3 of 22
22. (depart f3 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 4 of 22
23. (depart f3 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 5 of 22
24. (depart f3 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 6 of 22
25. (down f3 f2)
   deleted: (lift-at f3)
   added: (lift-at f2)
   goals met: 6 of 22
26. (board f2 p0)
   added: (boarded p0)
   goals met: 6 of 22
27. (board f2 p10)
   added: (boarded p10)
   goals met: 6 of 22
28. (board f2 p17)
   added: (boarded p17)
   goals met: 6 of 22
29. (board f2 p18)
   added: (boarded p18)
   goals met: 6 of 22
30. (board f2 p4)
   added: (boarded p4)
   goals met: 6 of 22
31. (board f2 p7)
   added: (boarded p7)
   goals met: 6 of 22
32. (depart f2 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 7 of 22
33. (depart f2 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 8 of 22
34. (depart f2 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 9 of 22
35. (depart f2 p19)
   deleted: (boarded p19)
   added: (served p19)
   goals met: 10 of 22
36. (down f2 f0)
   deleted: (lift-at f2)
   added: (lift-at f0)
   goals met: 10 of 22
37. (board f0 p2)
   added: (boarded p2)
   goals met: 10 of 22
38. (depart f0 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 11 of 22
39. (depart f0 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 12 of 22
40. (depart f0 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 13 of 22
41. (depart f0 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 14 of 22
42. (depart f0 p17)
   deleted: (boarded p17)
   added: (served p17)
   goals met: 15 of 22
43. (depart f0 p20)
   deleted: (boarded p20)
   added: (served p20)
   goals met: 16 of 22
44. (depart f0 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 17 of 22
45. (depart f0 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 18 of 22
46. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 18 of 22
47. (depart f1 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 19 of 22
48. (depart f1 p18)
   deleted: (boarded p18)
   added: (served p18)
   goals met: 20 of 22
49. (depart f1 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 21 of 22
50. (depart f1 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 22 of 22
